[{"title":"Master/Slave DNS Support ","slug":"master-slave-support","category":"Advanced DNS","content":"Currently DNSimple does not provide zone transfers in order for you to run your own DNS servers using DNSimple as a front-end.\r\n\r\nIf you are interested in having this functionality in a future version of DNSimple, please let us know by sending an email to support@dnsimple.com."},{"title":"DNSSEC Support","slug":"dnssec-support","category":"Advanced DNS","content":"Currently DNSimple does not support the DNSSEC extensions for DNS records.\r\n\r\nWe are examining the possibility of adding DNSSEC support in the future but do not currently have a specific timeline for when we would begin supporting it."},{"title":"Sandbox for Testing Calls to the API","slug":"sandbox","category":"API","content":"DNSimple maintains an isolated test site at [sandbox.dnsimple.com](https://sandbox.dnsimple.com/). Please feel free to test your experience and any application code that integrates with the DNSimple API here.\r\n\r\nThis site is generally an exact duplicate of the production application. Instead of actually performing domain registration, charging credit cards, etc. it mocks these functions.\r\n\r\nTo test mock registration features you will have to create a test account. Enter \"1\" for all the numbered credit card fields to activate your test account."},{"title":"IPv6 Domain Resolution","slug":"ipv6-support","category":"Advanced DNS","content":"All [DNSimple name servers](/articles/dnsimple-nameservers) have IPv6 addresses and respond to queries over IPv6.\r\n"},{"title":"Using an SSL Certificate with Heroku","slug":"ssl-certificate-with-heroku","category":"Heroku and DNSimple","content":"If you purchase an SSL certificate through DNSimple and would like to use it at Heroku then you will want to follow the instructions given on the Heroku web site for setting up a [custom SSL domain](https://devcenter.heroku.com/articles/ssl#customdomain-ssl).\r\n\r\nMake sure that you point your domain to your custom SSL endpoint that Heroku provides. Don't use the generic `proxy.herokuapp.com` endpoint or IP address to avoid [SSL certificate errors](/articles/ssl-certificate-herokuapp-error).\r\n\r\nNote that you can't use the Heroku one-click service at DNSimple if you are planning to use an SSL certificate, rather you should add the ALIAS (for the apex) or CNAME record (for subdomains) through the Advanced Editor.\r\n\r\nSome DNSimple customers have also put together blog posts about SSL certificates and Heroku:\r\n\r\n- http://ryan.mcgeary.org/2011/09/16/how-to-add-a-dnsimple-ssl-certificate-to-heroku/\r\n- http://bigtrapeze.com/2012/05/16/enabling-wildcard-ssl-on-a-heroku-rails-app/"},{"title":"Testing Forwarding","slug":"testing-forwarding","category":"Emails","content":"Once email forwarding is configured for your domain you may wish to confirm it is working as expected by sending a test message.\r\n\r\nIf you are using a GMail account in this case you may be surprised. Google silently ignores messages it determines were sent and received from the same account. This will occur even if the message is forwarded through another address.\r\n\r\nTo properly test that email forwarding please use an entirely separate account from the one that will receive forwarded messages.\r\n\r\n"},{"title":"Resending an SSL Certificate Approval Email","slug":"resending-ssl-certificates-email","category":"SSL Certificates","content":"If you haven't received the SSL Certificate approval email, for example because the email configuration was incorrect at the time of the submission, you can request the email to be resent.\r\n\r\n##### To resend the approval email\r\n\r\n1.  Log into your DNSimple account.\r\n1.  Go to the *Domains* tab and select the relevant domain.\r\n1.  Scroll down to the *Active SSL Certificate* list and click on the certificate.\r\n\r\n    ![](http://f.cl.ly/items/1G3U1W1Z1q0v0n1P2y0H/dnsimple-ssl-pagelink-submitted.png)\r\n\r\n1. At the page, on the status line, look for the link to resend the approval email.\r\n\r\n    ![](http://f.cl.ly/items/2J1x321z0K300R2Q161i/dnsimple-ssl-resend-approval-link.png)\r\n\r\n    If the link is not present, it means the certificate is in a status where the email cannot be resent (e.g. a not submitted or expired certificate).\r\n\r\n1.  Click the link and follow the procedure described in the page. Depending on the certificate authority, you will either be able to resend the email directly from the interface or you will be asked to contact the [CA](http://support.dnsimple.com/articles/what-is-a-certificate-authority) support team for additional assistance.\r\n\r\n    ![](http://f.cl.ly/items/0E1F2F3w2X1R3x333t2t/dnsimple-ssl-resend-approval-rapidssl.png)\r\n"},{"title":"Secondary DNS Support","slug":"secondary-dns-support","category":"Advanced DNS","content":"DNSimple does not currently provide secondary DNS.\r\n\r\nIf you are interested in having this functionality in a future version of DNSimple, please let us know by sending an email to support@dnsimple.com."},{"title":"DNS Template Variables","slug":"dns-template-variables","category":"Advanced DNS","content":"DNSimple enables you to create templates for DNS records usable across any of your domains.\r\n\r\nTo create a record that automatically fills in the domain name to which the template is applied use the variable:\r\n\r\n```text\r\n{{domain}}\r\n```\r\n\r\nor the symbol\r\n\r\n```text\r\n@\r\n```\r\n"},{"title":"Deleting a Domain","slug":"deleting-domain","category":"Domains","content":"To delete a domain from your DNSimple account go to the [domain list](https://dnsimple.com/domains), search for the domain then press the *Delete Domain* button.\r\n\r\n![Delete a Domain](http://f.cl.ly/items/2Z3w1v0H3T1L062e0w1a/dnsimple-domain-delete.png)\r\n\r\nWhen a domain is deleted, DNSimple will stop resolving DNS for the domain.\r\n\r\nIf the domain is resolved with DNSimple, we will immediately stop resolving it and the records will be removed according to their TTL.\r\n\r\nIf the domain is registered with DNSimple, deleting the domain from your account will not delete the domain registration in the registry. Once a domain is registered you can't delete it, you have to wait for the domain to expire.\r\n\r\nYou should not delete a active domain registered or resolved with DNSimple."},{"title":"Suspended Account","slug":"account-suspended","category":"Account","content":"There are a variety of reasons your account may be suspended.\r\n\r\nIf you attempt to log in and you receive an error message indicating your account is suspended, please contact us directly at support@dnsimple.com and we will help you get your account back in working order."},{"title":"What is DNSimple","slug":"what-is-dnsimple","category":null,"content":"We provide DNS and domain registration that's simple to use. You can also purchase SSL certificates and set up email forwarding."},{"title":"What is the minimum time-to-live provided by DNSimple?","slug":"what-is-the-minimum-time-to-live-provided-by-dnsimple","category":"Advanced DNS","content":"The standard time-to-live (TTL) for records added to DNSimple is 1 hour.\r\n\r\nThrough the web interface you may select a TTL as low as 1 minute. If you are preparing to change DNS records for a service then you may want to lower your records' TTLs so that the change from one address to another occurs quickly. During normal operation it is usually beter to keep your TTL at 1 hour or more so that requests to common name servers only need to be refreshed once an hour, thus resulting in better performance for your clients.\r\n\r\nFrom time to time we may review traffic patterns and request that you raise the TTL to a higher value to improve cache results. If we need to do that we'll contact you via email first."},{"title":"Pointing a Domain to DNSimple","slug":"pointing-domain-to-dnsimple","category":"DNS","content":"## The domain is registered with DNSimple\r\n\r\nIf you register your domain with DNSimple then it will automatically use our Anycast name servers.\r\n\r\nIf you transferred your domain to DNSimple or if you have previously used other name servers, then go to your domain's Manage page and click the link Switch to DNSimple if you are not already using our name servers.\r\n\r\n![](http://f.cl.ly/items/0Q330V0V1A0o3P2c2i23/registered-domain-example.com%20-%20DNSimple-1.png)\r\n\r\n## The domain is registered with another provider\r\n\r\nFollow these instructions to [delegate a domain registered with another registrar to DNSimple](http://support.dnsimple.com/articles/delegating-dnsimple-hosted).\r\n\r\n## Name server propagation\r\n\r\nPlease note that it may take up to 24 hours for a name server change to propagate. The whois response is normally a good way to [determine if the changes have been submitted properly](/articles/domain-resolution-issues).\r\n"},{"title":"Whois Privacy Protection Support","slug":"whois-privacy-support","category":"Whois Privacy","content":"All of the generic top-level domains support Whois Privacy Protection:\r\n\r\n- com\r\n- net\r\n- org\r\n- info\r\n- biz\r\n- name\r\n- pro\r\n- tel\r\n- asia\r\n- mobi\r\n\r\nThe following country code top-level domains support Whois Privacy Protection:\r\n\r\n- cc\r\n- cm\r\n- me\r\n- tv\r\n"},{"title":"Purchasing an SSL Certificate","slug":"purchasing-ssl-certificates","category":"SSL Certificates","content":"To purchase an SSL certificate first create and activate your DNSimple account. Next, add the second-level domain for your certificate. For example, if you would like to purchase www.example.com then add the domain example.com. You do not need to register or transfer the domain, simply add it to your account.\r\n\r\nOnce you've added the domain, go to the domain's Manage page and click on the Buy an SSL Certificate link or button. Enter the host name for your certificate. You may want to enter a subdomain, such as www, or a wildcard such as *. Read more on [how to select a certificate host name](/articles/ssl-certificate-hostname) for details.\r\n\r\nIf you would like for us to generate your Private Key and Certificate Signing Request (CSR), then leave the \"Generate a private key and certificate signing request for me\" check box checked. If you would like to generate your own key and CSR then uncheck the box and paste in your CSR. If you generate your own CSR make sure that the private key is at least 2048 bytes in length and that the Common Name on the request matches the fully-qualified domain name you would like (as in, www.example.com).\r\n\r\nEnter your contact details and press Purchase Certificate. On the next screen, select an approver email address which can receive email. An email will be sent to this address with instructions on how to approve the certificate request. Once the certificate request is approved it will be submitted to the [Certificate Authority](/articles/what-is-a-certificate-authority). If there are no issues with the certificate request then you should receive notification that your certificate is ready via email shortly thereafter.\r\n\r\nPlease note that it may take up to 24 hours for some certificate requests to be processed depending on the number of requests currently queued at the Certificate Authority.\r\n\r\nIf you are planning on using your certificate on Heroku then [read their instructions](https://devcenter.heroku.com/articles/ssl-certificate-dnsimple) for additional details."},{"title":"Sharing Domain Management with Another User","slug":"sharing-domain","category":"Domains","content":"In DNSimple you can share a domain with other users so that they can manage it. For example, if you have a large organization you can share access to the domains with one or more users.\r\n\r\nPlease see http://blog.dnsimple.com/sharing-domain-management-responsibilities/ for a walk through of how sharing works.\r\n\r\nCurrently you can only share DNS management responsibilities with others but you cannot give them privileges to add or modify domain registrations, transfers or SSL certificates."},{"title":"What is a TLD?","slug":"what-is-a-tld","category":"Domains","content":"The term top-level domain, or TLD, refers to the first part of every domain name. For example, in the domain name dnsimple.com the TLD is com.\r\n\r\nDNSimple supports almost every TLD for hosted DNS and supports a large number of TLDs for registration. For more details view the [full list of TLDs supported by DNSimple for registration and transfer](https://dnsimple.com/tld-pricing)."},{"title":"Email Forwarding","slug":"email-forwarding","category":"Emails","content":"Email forwarding can be enabled on a domain-by-domain basis. The cost is $2 per month per domain for up to 1000 messages delivered.\r\n\r\n## Enabling email forwarding\r\n\r\nTo enable email forwarding visit a domain's manage page and follow the **Email Forwarding** link under **Tasks**.\r\n\r\nCreate an email forward to enable the service.\r\n\r\nWhen you enable email forwarding we will automatically add the various DNS records needed to support forwarding.\r\n\r\n## Creating an email forward\r\n\r\nTo create an email forward you need to specify the **From** and **To** fields.\r\n\r\nThe **From** field is used to match an email address to forward from. Enter either a specific name (such as \"support\") without the domain. \r\n\r\nTo create a catch-all address use a wildcard expression which is a period followed by an asterisk `(.*)`.\r\n\r\nIn the **To** field enter the email address you would like as the recipient of the email. You can use a Gmail address or any other email address.\r\n\r\n**Note:** when you use email forwarding on a domain you cannot use any other email service providers (such as Google Apps)."},{"title":"What is an ALIAS record?","slug":"alias-record","category":"DNS","content":"An **ALIAS** record is a virtual record type that we created to provide [CNAME](/articles/cname-record)-like behavior on apex domains.\r\n\r\nFor example, if your domain is example.com and you want it to point to a host name like `myapp.herokuapp.com`, then you cannot use a CNAME record, but you can use an ALIAS record. The ALIAS record will automatically resolve your domain to one or more A records at resolution time and thus resolvers see your domain simply as if it had A records.\r\n"},{"title":"What is a CNAME record?","slug":"cname-record","category":"DNS","content":"**CNAME** stands for Canonical Name. CNAME records can be used to alias one name to another.\r\n\r\nFor example, if you have a server where you keep all of your documents online, it might normally be accessed through `docs.example.com`. You may also want to access it through `documents.example.com`. One way to make this possible is to add a CNAME record that points `documents.example.com` to `docs.example.com`. When someone visits `documents.example.com` they will see the exact same content as `docs.example.com`.\r\n\r\nTo use CNAME records, select CNAME from the *Add Record* drop down in the advanced editor. Then enter the hostname you would like to alias from and the fully-qualified domain name you would like to alias to. You may also enter `@` in the Alias for field to represent the domain itself.\r\n\r\nFor example, if the domain were `example.com` and you wanted `www.example.com` to point to `example.com` you could put `www` in the name field and `@` in the alias for field.\r\n"},{"title":"DNSimple Anycast Name Servers","slug":"dnsimple-anycast-nameservers","category":"DNS","content":"All domains at DNSimple are now served through Anycast. Please use the name servers from the [DNSimple Name Servers](http://support.dnsimple.com/articles/dnsimple-nameservers) support article for all domains.\r\n\r\nIf you would like to know more about why Anycast is good for you, then [read this support article](http://support.dnsimple.com/articles/why-anycast-dns).\r\n\r\nDNSimple currently has servers in 5 locations around the world:\r\n\r\n* San Jose, CA, USA\r\n* Chicago, IL, USA\r\n* Ashburn, VA, USA\r\n* Amsterdam, Netherlands\r\n* Tokyo, Japan"},{"title":"How do I change my name servers?","slug":"change-name-servers","category":"Name Servers","content":"To change your name servers to another DNS provider, your domain must be registered with DNSimple. \r\n\r\nFirst go to \"Manage\" your domain.\r\n\r\n![Manage](http://f.cl.ly/items/22072R2m1o2I3z0u0P0I/Image%202013.11.29%209%3A30%3A26%20AM.png)\r\n\r\nOnce there, follow \"Change Name Servers\" in the \"Registration Status\" section.\r\n\r\n![Change Name Servers link](http://f.cl.ly/items/3i0Q3N3K1N1L1I3o011F/Image%202013.11.29%209%3A32%3A24%20AM.png)\r\n\r\nEnter the names of the name servers you would like to use and click \"Change Name Servers\" to complete the change.\r\n\r\n![Complete name server change](http://f.cl.ly/items/0R0Z1l3B1K34473a3I3P/Image%202013.11.29%209%3A33%3A23%20AM.png)"},{"title":"Pointing a Domain at Another Registrar to DNSimple","slug":"delegating-dnsimple-hosted","category":"DNS","content":"First, find the place on your domain registrar's web site where you can enter our name servers.\r\n\r\nTo switch to our DNS Anycast network, enter the [DNSimple name servers](/articles/dnsimple-nameservers):\r\n\r\n- ns1.dnsimple.com\r\n- ns2.dnsimple.com\r\n- ns3.dnsimple.com\r\n- ns4.dnsimple.com\r\n\r\n## Name server propagation\r\n\r\nPlease note that it may take up to 24 hours for a name server change to propagate. The whois response is normally a good way to [determine if the changes have been submitted properly](/articles/domain-resolution-issues).\r\n"},{"title":"What is an MX record?","slug":"mx-record","category":"DNS","content":"MX stands for Mail eXchange. MX Records tell email delivery agents where they should deliver your email. You can have many MX records for a domain, providing a way to have redundancy and ensure that email will always be delivered.\r\n\r\nGoogle Apps provides a common example of using MX Records for email delivery. When you create a Google Apps account and you want your email to be delivered to your Google Apps mail account, Google provides you with a set of MX records that you need to add to DNSimple. Here are the default MX records that Google suggests you should add:\r\n\r\n- aspmx.l.google.com 1\r\n- alt1.aspmx.l.google.com 5\r\n- alt2.aspmx.l.google.com 5\r\n- aspmx2.googlemail.com 10\r\n- aspmx3.googlemail.com 10\r\n\r\nGoogle provides you with 5 different servers that can except your email. Each MX record includes a priority value, which is a relative value compared to the other priorities of MX records for your domain. Addresses with lower values will be used first. Therefore, when a mail agent wants to deliver an email to you it would first attempt to deliver to `aspmx.l.google.com`. If that server cannot handle the delivery it would then move onto `alt1.aspmx.l.google.com`, and if that server cannot handle the delivery then it would move onto `alt2.aspmx.l.google.com`, and so on.\r\n\r\nMX records make it easy to define what servers should handle email delivery and allows you to provide multiple servers for maximum redundancy and ensured delivery."},{"title":"Securing your DNSimple Account","slug":"account-securing","category":"Account","content":"Here are some simple rules to follow to help make your DNSimple account more secure:\r\n\r\n- Use a password for your account that includes letters, numbers and punctuation characters. You can even use multiple words and made up phrases.\r\n- Use a long password (16 characters or more).\r\n- Do not share your account with others. You can use DNS sharing if you would like others to be able to manage your DNS.\r\n- Never provide your password to someone you do not know. This includes DNSimple support - we do not need your password to help you troubleshoot issues with DNSimple.\r\n- Use a unique password for your DNSimple account. Do not reuse a password from another account.\r\n\r\nFor an extra level of security [go to your Account page](https://dnsimple.com/account) and enable two-factor auth using Authy. Once you enable two-factor auth you will need log in first with your email and password and then use a generated token obtained either via the Authy application on your phone or via SMS."},{"title":"What is Whois Privacy Protection?","slug":"what-is-whois-privacy","category":"Whois Privacy","content":"Most domain names registered through DNSimple, or any other domain registrar for that matter, require the collection of essential contact information, such as the registrant's name, email address, mailing address, phone number, etc. This information is used in case a dispute arises about the domain name.\r\n\r\nThis information is often displayed in the global Whois system (also known as WHOIS). Information displayed in the global Whois system is public and can be viewed by anyone.\r\n\r\nIf you would like to keep your contact information private for a domain then you may sign up for the DNSimple Whois Privacy Protection service (WPPS). This service will replace the public information that you provide with an anonymous proxy identity in the public Whois database. This includes replacing your email address with a proxy email address and replacing your address and contact information with the information from an entity called \"Whois Privacy Protection Service, Inc.\".\r\n\r\nThe cost for this service is $8 per year, per domain.\r\n\r\nYou can choose to purchase Whois Privacy Protection for any of your domains in TLDs that support WPPS at any time.\r\n\r\nHere is an example of the the Whois data for a domain that has Whois Privacy Protection enabled:\r\n\r\n\r\n```text\r\nDomain name: dnsimple.net\r\n\r\nRegistrant Contact:\r\n\r\n   Whois Privacy Protection Service, Inc.\r\n   Whois Agent ()\r\n   Fax:\r\n   PMB 368, 14150 NE 20th St - F1\r\n   C/O dnsimple.net\r\n   Bellevue, WA 98007\r\n   US\r\n\r\nAdministrative Contact:\r\n\r\n   Whois Privacy Protection Service, Inc.\r\n   Whois Agent (wqyygglqlt@whoisprivacyprotect.com)\r\n   +1.4252740657\r\n   Fax: +1.4259744730\r\n   PMB 368, 14150 NE 20th St - F1\r\n   C/O dnsimple.net\r\n   Bellevue, WA 98007\r\n   US\r\n\r\nTechnical Contact:\r\n\r\n   Whois Privacy Protection Service, Inc.\r\n   Whois Agent (wqyygglqlt@whoisprivacyprotect.com)\r\n   +1.4252740657\r\n   Fax: +1.4259744730\r\n   PMB 368, 14150 NE 20th St - F1\r\n   C/O dnsimple.net\r\n   Bellevue, WA 98007\r\n   US\r\n```"},{"title":"How do I prepare my domain to transfer out of GoDaddy?","slug":"how-do-i-prepare-my-domain-to-transfer-out-of-godaddy","category":"Domain Transfers","content":"If you are looking to transfer more than a few domains from GoDaddy then follow our step-by-step guide for preparing your domains for transfer out: http://blog.dnsimple.com/post/3167427271/preparing-domains-in-godaddy-for-transfer-out"},{"title":"Transferring a Domain without Downtime","slug":"transferring-domain-without-downtime","category":"Domain Transfers","content":"Transferring domain names from one registrar to another is often something that is done with great reluctance, if for no other reason than concerns of downtime. The following steps will hopefully help you avoid any downtime while transferring so that the process is as smooth and easy as possible:\r\n\r\nFirst, set up your account on DNSimple, activate your account and add the domain *without* transferring it. This will give you the chance to fully set up and test your DNS records *before* you move the domain. Remember that when you add your domain name it should be the domain only and not subdomains. You will add subdomains as DNS records in the next step.\r\n\r\nFor example: create and activate your account, navigate to your domain list and click Add a Domain. Enter just the domain name in the Domain Name box, without any subdomains, as in \"example.com\". Do *not* add the \"www\" prefix.\r\n\r\nNext, add the DNS records for the domain. To do this you can either use the Add Services to Domain feature in the domain's management screen to add all of the DNS records for common services like Google Apps, or you can add records one-by-one using the Advanced Editor.\r\n\r\nOnce you've added all of the records for your domain, use a tool like `dig`, which is a command-line tool, to verify each of the records.\r\n\r\nExample: `dig @ns1.dnsimple.com mydomain.com any` will return all of the DNS records for the base domain. To look up details for a subdomain: `dig @ns1.dnsimple.com www.mydomain.com any` will return all of the DNS records for the subdomain www under the domain mydomain.com.\r\n\r\nAfter you have verified all of your records with a tool such as dig, then you should switch your name servers from your current name servers to DNSimple's name servers. You will do this at your current registrar. This step is essential as it ensures that your DNS will continue operating during the transfer process. The DNSimple name servers are ns1.dnsimple.com, ns2.dnsimple.com, ns3.dnsimple.com and ns4.dnsimple.com. Each registrar is different in how you change the name servers for a domain, however all of them should allow you to make this change.\r\n\r\nOnce the name servers are changed to DNSimple you will need to wait for the DNS information to propagate. This means that name servers that are currently caching your domain's DNS records will need to be given time for their caches to clear and to begin reporting the records from DNSimple's name servers. On your domain's manage page you should see the Domain Status as \"Active\" once the propagation has completed. We test against a variety of public name servers provided by organizations such as the Google, OpenDNS and Level3. You may also want to verify against your local name servers.\r\n\r\nExample: if your domains are using DNSimple's name servers then this following command should show this: `dig mydomain.com ns`. This will list the name servers for the domain.\r\n\r\nOnce you're satisfied that the DNS setup is complete and DNSimple is providing DNS service for your domain then you may begin the transfer process without concern for downtime.\r\n"},{"title":"DNSimple Status Page","slug":"dnsimple-status","category":"DNSimple","content":"We make our current system status as well as our uptime history available at [status.dnsimple.com](http://status.dnsimple.com/).\r\n\r\nWe strive to always have at least one name server responding to queries at all times.\r\n\r\n**Note:** Downtime on a single server does not indicate downtime for the system as a whole."},{"title":"DNSimple Prices","slug":"dnsimple-prices","category":"DNSimple","content":"DNSimple DNS hosting is billed as a monthly service. We currently offer four pricing tiers:\r\n\r\n- **Bronze** $3/month for up to 2 managed domains\r\n- **Silver** $8/month for up to 10 managed domains\r\n- **Gold**: $18/month for up to 50 managed domains\r\n- **Platinum**: $50/month for up to 500 managed domains\r\n\r\nDNSimple domain registrations and transfers are billed on a yearly basis. Pricing varies depending on the domain name. For more information view the [domain pricing list](https://dnsimple.com/tld-pricing).\r\n\r\nSSL certificates are available in two flavors:\r\n\r\n- Standard single host SSL certificates from RapidSSL ($20 per year)\r\n- Wildcard certificates from Comodo ($100 per year)"},{"title":"Requesting a Transfer Code","slug":"requesting-transfer-code","category":"Domain Transfers","content":"To request a transfer code to transfer a domain out of DNSimple, go to your domain's Manage page and click on the Transfer Out link in the Tasks section. This will unlock the domain and email a transfer code to the domain registrant.\r\n\r\nIf you have requested a domain transfer out and have not received a code then please contact support@dnsimple.com  and include your domain name in the email.\r\n\r\nWe'll be happy to look into it and figure out why the code has not yet arrived."},{"title":"How can I issue a new transfer order when a transfer is denied?","slug":"how-can-i-issue-a-new-transfer-order-when-a-transfer-is-denied","category":"Domain Transfers","content":"If you receive a message from your current registrar that a domain transfer was denied it was likely because the name is locked, was registered within the last 60 days, or because the domain had whois privacy turned on.\r\n\r\nBefore you can submit a new transfer request you'll need to wait until the current open transfer request is closed. Most domain registries only allows one transfer request for a domain at a time and they do not allow transfer requests to be cancelled by the requesting registrar once they're issued to the registry.\r\n\r\nOnce the currently open transfer closes then make sure to unlock the domain at the current registrar, ensure it is not private, and then reissue the transfer from the DNSimple web site by going to your domain list and clicking on the \"Transfer\" button for the domain or by going to \"Manage\" for the domain and transferring it from there."},{"title":"What is a SOA Record?","slug":"soa-record","category":"DNS","content":"An SOA record is a Start of Authority. Every domain must have a Start of Authority record at the cutover point where the domain is delegated from its parent domain. For example if the domain mycompany.com is delegated to DNSimple, we must include an SOA record for the name mycompany.com in our authoritative DNS records. We add this record automatically for every domain that is added to DNSimple and we show this record to you as a System Record in your domain's Manage page.\r\n\r\nHere is an example of the content from an SOA record:\r\n\r\n    ns1.dnsimple.com admin.dnsimple.com 2013022001 86400 7200 604800 300\r\n\r\nThe SOA record includes the following details:\r\n\r\n- The primary name server for the domain, which is ns1.dnsimple.com or the first name server in the vanity name server list for vanity name servers.\r\n- The responsible party for the domain, which is admin.dnsimple.com.\r\n- A timestamp that changes whenever you update your domain.\r\n- The number of seconds before the zone should be refreshed.\r\n- The number of seconds before a failed refresh should be retried.\r\n- The upper limit in seconds before a zone is considered no longer authoritative.\r\n- The negative result TTL (for example, how long a resolver should consider a negative result for a subdomain to be valid before retrying).\r\n\r\nFor the moment, these values cannot be configured by you."},{"title":"\"Product Expiring Tomorrow\" Notification","slug":"product-expiring-tomorrow-notification","category":"DNSimple","content":"The **Product Expiring Tomorrow** email contains a list of domains expiring within 24 hours.\r\n\r\nThis notification is an important reminder and gives you the latest chance to renew a domain in case you forgot about it for whatever reason.\r\n\r\n![Email](http://f.cl.ly/items/1s2a1S3Y000p2N181i2S/notifications-expiring-tomorrow.png)\r\n\r\nThis is a final notice and you will receive it as soon as one of more products are expiring in the next 24 hours. Unlike the **Product Expiration** digest, this email is delivered only once, the day before the expiration date.\r\n\r\nThis email is part of the [expiring product notification feature](/articles/expiring-product-email-notifications)."},{"title":"Pointing the Domain Apex to Heroku","slug":"domain-apex-heroku","category":"Heroku and DNSimple","content":"Your domain apex is the second or third level domain provided to you by your domain registrar. For example, `dnsimple.com` is the apex domain for DNSimple.\r\n\r\nTo point your apex to Heroku you have 2 possibilities:\r\n\r\n- Use the Heroku one-click service (for non-SSL usage)\r\n- Add an [ALIAS record](/articles/alias-record) pointing your custom Heroku end point (for non-SSL and SSL usage)\r\n\r\n## Creating an ALIAS for the apex domain\r\n\r\nGo to the advanced editor page for your domain to manage your DNS records. Click *Add a Record* and select the *ALIAS* record type.\r\n\r\n![Add a Record](http://f.cl.ly/items/3s2k3N2h1N0q182P1D1g/dnsimple-alias-record.png)\r\n\r\nIn the form enter the following settings:\r\n\r\n- **Name**: leave it blank (we want to create an `ALIAS` for the apex domain)\r\n- **Alias for**: enter your Heroku endpoint (for non-SSL) or Heroku SSL endpoint (for SSL).\r\n\r\n**Important:** If you are using an SSL certificate, you must point the alias to the [Heroku SSL endpoint](https://devcenter.heroku.com/articles/ssl-endpoint) or your browser will display a [certificate error](/articles/ssl-error-herokuapp) when accessing the HTTPS version of the site.\r\n\r\n![Alias Settings](http://f.cl.ly/items/2i2C093D3D3E092E151L/dnsimple-alias-herokussl.png)\r\n\r\nPress *Add Record* to create the record."},{"title":"Email Hosting Support","slug":"email-hosting","category":"Emails","content":"We do not provide email hosting at this time. If you are looking to transfer your domain and your registrar currently provides your email then you have a few options:\r\n\r\n1. [Use email forwarding](/articles/email-forwarding) - We provide email forwarding at $2 per month per domain for up to 1000 messages. With email forwarding you may forward your email to another email account such as your Gmail account.\r\n1. Switch to Google Apps for Business - You can use our one-click template to set up the DNS for Google Apps and then go through the Google Apps signup process.\r\n1. Select another email provider such as [FastMail](https://www.fastmail.fm/)."},{"title":"API Documentation","slug":"api-documentation","category":"API","content":"You can find our API documentation at http://developer.dnsimple.com\r\n\r\nThis site includes details about all of our API endpoints as well as libraries and tools that have been built on top of the library.\r\n\r\nIf you build a library or tool and would like it included in the list, please send us a message: support@dnsimple.com - we'd love to hear from you!"},{"title":"Account Activation","slug":"account-activation","category":"Account","content":"In order to register or transfer domain names through DNSimple, or to provide DNS resolution, you must activate your DNSimple account.\r\n\r\nActivation is easy and includes a free 30 day trial. You can cancel at any time during your 30 day trial without being charged.\r\n\r\nTo activate your account log in and click on *Activate Your Account*. Choose the plan that fits your needs by clicking on the *Choose Plan* button below the plan. Finally, enter your credit card information and click *Start My Free Trial*.\r\n\r\nYour account is now active. Any domains that you update to use our name servers will now resolve with the DNSimple system.\r\n"},{"title":"Yearly Billing","slug":"yearly-billing","category":"Account","content":"By default, all accounts are billed monthly according to the plan you subscribed to. You may, however, switch to yearly billing for your DNSimple subscription and benefit from 1 month of service for free.\r\n\r\n## Yearly billing benefits\r\n\r\nWhen you make the switch, you will automatically be billed for a year's worth of service at your current plan type, minus the price of one month. The subscription will be automatically renewed once per year, at the date you switched to yearly billing.\r\n\r\nAny email forwards or extra domains (for Platinum accounts) will be billed immediately for 1 year's worth of service.\r\n\r\n## Switching to yearly billing\r\n\r\nTo switch to yearly billing, [log into DNSimple](https://dnsimple.com/login) and go to [your account page](https://dnsimple.com/account). There you will see a button to Switch to Yearly Billing.\r\n\r\n![Switch to Yearly Billing](http://f.cl.ly/items/3G2l3q00471u2H2a3x1y/Screen_Shot_2013-02-22_at_10.09.22_AM.png)\r\n\r\nYou can change back to monthly billing at any time and your account will be prorated for the time not yet used."},{"title":"Why Should I Register my Domain Name with DNSimple?","slug":"reasons-registering-domain","category":"DNSimple","content":"Domain registration with DNSimple is designed to be quick and easy with no up-selling or hassles.\r\n\r\nDomain registration is a simple process:\r\n\r\n- Enter a name and verify that it is available.\r\n- Select a registrant from your contacts or add a new contact.\r\n- For domains that require extended attributes (like .ca and .us), fill in the required fields.\r\n- Register the domain.\r\n\r\nYes, it's really that easy. We won't try to sell you a bunch of other services when you register your domain.\r\n\r\nAll domains registered with DNSimple automatically use DNSimple's name servers and hosted DNS, making the domain set up process very straightforward.\r\n\r\n**Note:** We do not currently offer domain registration as a stand-alone service. Our core business is hosted DNS and thus the registration requires the use of our hosted DNS service. We do provide hosted DNS without using our registration services.\r\n"},{"title":"CloudFlare","slug":"cloudflare-service","category":"Services","content":"[CloudFlare](http://www.cloudflare.com/) is a service that offers protection and acceleration of your website by routing requests through their network.\r\n\r\n## CloudFlare Integration\r\n\r\nCloudFlare has two integration methods:\r\n\r\n- Change your name servers to those supplied by CloudFlare. This method is available if you create an account via their website. To use this method first configure your DNS at CloudFlare. Next, \"Manage\" your domain at DNSimple, follow \"Change Name Servers\", and enter CloudFlare supplied name servers.\r\n- Through third-party \"Certified Hosting Provider Partners\". In this case DNSimple manages automatic provisioning and configuration of your CloudFlare account and DNS template. This greatly simplifies CloudFlare integration for your domain plus you're able to continue using DNSimple features. \"Manage\" your domain, press the \"One-Click Services\" button near the top of the page, and \"Add\" CloudFlare.\r\n\r\n## DNS limitations\r\n\r\nCloudFlare caches your site content at locations across the globe. It uses DNS to route your requests to one of these locations depending on various factors. To support this technology within DNS limitations it is best to use a host name (i.e. www.example.com) rather than your domain apex (i.e. example.com). CNAME records at a domain apex are disallowed or will cause your DNS respond incorrectly. You may wish to use DNSimple's URL redirection record to forward requests from your domain apex to \"www\" for instance.\r\n\r\n## ALIAS record limitations\r\n\r\nDNSimple offers a virtual record type called an ALIAS record. This allows sites to work around a limitation of CNAME records at the domain apex by resolving to an A record at the name server. Because CloudFlare may use the name server physical location to determine how your request will be routed it would short circuit the utility of CloudFlare. As such we advise against using ALIAS records with CloudFlare."},{"title":"\"Product Expiration\" Notification","slug":"product-expiration-notification","category":"DNSimple","content":"The **Product Expiration** email contains the list of products (purchased domains, certificates and whois privacies) expiring within 2 months, grouped by expiration range.\r\n\r\n![Email](http://f.cl.ly/items/0s0s093n1T2m3h3w3d0v/notifications-expiring.png)\r\n\r\nThere are four expiration ranges: in a day, within a week, a month and 2 months. These ranges cannot be customized.\r\n\r\nThe expiring product notification system is designed to reduce the number of emails we deliver to your inbox and make them more effective.\r\n\r\nThe notification is delivered as soon as one of your products enters the 60-day expiration period. We deliver at most one email every week, containing an overview of all your expiring products.\r\n\r\nThis email is part of the [expiring product notification feature](/articles/expiring-product-email-notifications)."},{"title":"Domain Transfer Pricing","slug":"domain-transfer-pricing","category":"Domain Transfers","content":"Exactly like domain registration, domain transfer price varies depending on the TLD you want to transfer. For the full list visit the the [DNSimple domain pricing](https://dnsimple.com/tld-pricing) page.\r\n\r\nWe only support domain transfer for the TLDs included in that list.\r\n\r\nPlease note that if you see `N/A` in the transfer column for a TLD it means we currently don't support inbound transfers for that specific TLD, although we may support new registrations.\r\n\r\n## Domain transfer costs\r\n\r\nWhen you transfer a domain, we charge a [transfer fee](https://dnsimple.com/tld-pricing) and extend your domain for 1 year from the current expiration date. The extension of the domain is required by ICANN whenever a domain is transferred.\r\n\r\nThe transfer fee covers the cost of transferring the domain to us and the domain extension. The extension is applied to the current expiration date so that you don't loose years you already paid.\r\n\r\n## Domain expiration extension\r\n\r\nLet's say you want to transfer a domain already paid through a number of years. A common question is if you will keep those years. The short answer is yes.\r\n\r\nWhen you transfer a domain name it is extended from the current expiration date so you do not lose time from your registration.\r\n\r\nThe one exception to this rule is when a domain reaches an expiration date that is 10 years away. In this case the domain will not be extended."},{"title":"Transferring a UK domain","slug":"transferring-a-uk-domain","category":"Domain Transfers","content":"To transfer a UK domain (i.e. example.co.uk) into DNSimple you must provide your current registrar with our IPS tag after starting the transfer process. Our IPS tag is: ENOM\r\n\r\nTo transfer a UK domain out of DNSimple send an email to support@dnsimple.com with your new registrar's IPS tag."},{"title":"Close Your Account","slug":"close-account","category":"Account","content":"To close your account and remove all of your domains from DNSimple, log in and go to https://dnsimple.com/account and click on the red \"Close Account\" button at the bottom of the page.\r\n\r\nThis will immediately stop all domain resolution for your domains through DNSimple. Additionally you will no longer be able to request transfer codes and unlock registered domains in order to transfer them to another registrar."},{"title":"Can I use DNSimple for Drop-catching?","slug":"drop-catching","category":"API","content":"No, DNSimple may not be used for drop-catching domains at this time."},{"title":"Adding services","slug":"adding-services","category":"Services","content":"Services are defined in a project on GitHub. This project may be forked and updated by you to add a new service. Once you have added the files required for your service, issue a pull request so we can review it and deploy it.\r\n\r\nPlease visit https://github.com/aetrion/dnsimple-services for full instructions."},{"title":"What is a Certificate Authority?","slug":"what-is-a-certificate-authority","category":"SSL Certificates","content":"A certificate authority (CA) is an entity that issues digital certificates.\r\n\r\nThe digital certificate certifies the ownership of a public key by the named subject of the certificate. This allows others (relying parties) to rely upon signatures or assertions made by the private key that corresponds to the public key that is certified.\r\n\r\nIn this model of trust relationships, a CA is a trusted third party that is trusted by both the subject (owner) of the certificate and the party relying upon the certificate.\r\n"},{"title":"Contacting DNSimple Support","slug":"dnsimple-support","category":"DNSimple","content":"There are multiple ways to contact us:\r\n\r\n- Email support@dnsimple.com\r\n- Send us a message to our [@dnsimple](https://twitter.com/dnsimple) account on Twitter.\r\n- If you are logged into your DNSimple account then click on the envelope on the bottom of any page to see your in-app customer support inbox.\r\n"},{"title":"Account Creation","slug":"account-creation","category":"Account","content":"To sign up for an account go to the [DNSimple website](https://dnsimple.com) and click on *Get Started Now*. Fill out the details and press *Sign up*.\r\n\r\nYou now have a DNSimple account and can beginning adding domain names and records.\r\n\r\nYou will not be able to register a new domain, nor will your domains resolve, until you activate your account by providing your payment details, however you can try out the site and see how to manage domains without activating your account.\r\n"},{"title":"Changing Account Email","slug":"changing-account-email","category":"Account","content":"You can change the email associated to your account from the DNSimple account page.\r\n\r\n1. Go to the [DNSimple account page](https://dnsimple.com/account).\r\n\r\n1. Click on the *Change Email Address* link on the right sidebar.\r\n\r\n    ![Account page](http://f.cl.ly/items/1c1e2N0r0B03062k0l0M/dnsimple-account-page.png)\r\n\r\n1. Enter the new email address and press *Save*.\r\n\r\n    ![Enter email address](http://f.cl.ly/items/0K1Q3G022e0h063z2P2v/dnsimple-change-email.png)\r\n\r\n1. If the update is successful, you'll be redirected to the account page. Make sure the account correctly displays the new address.\r\n\r\n    ![Check email address](http://f.cl.ly/items/3D2b2M3z3T2a050L2803/dnsimple-email-changed.png)\r\n"},{"title":"SSL Certificates","slug":"ssl-certificates","category":"SSL Certificates","content":"SSL (Secure Sockets Layer) is a security protocol designed to secure the communication between a server and a client, for example a web server and a browser.\r\n\r\nAn SSL certificate is required to enable SSL on your site and use the HTTPS protocol.\r\n\r\nDNSimple offers two types of SSL certificates signed by globally recognized [certificate authorities (CAs)](/articles/what-is-a-certificate-authority).\r\n\r\n\r\n## Supported Certificate Types\r\n\r\nWe currently provide:\r\n\r\n- Single-name SSL certificates from RapidSSL\r\n- Wildcard SSL certificates from Comodo\r\n\r\nAll these certificates are domain-validated.\r\n\r\n### Single-name SSL certificates from RapidSSL\r\n\r\nThe RapidSSL certificate is a domain-validated, single-name certificate.\r\n\r\nThis SSL certificate costs $20 per year and covers one host and the root domain in case of the www hostname.\r\n\r\n### Wildcard SSL certificates from Comodo\r\n\r\nThe Comodo Essential certificate is a domain-validated, wildcard certificate.\r\n\r\nThis SSL certificate costs $100 per year and covers all single-level subdomains as well as the root domain.\r\n\r\n### Organization Validated and Extended Validation certificates\r\n\r\nWe currently don't provide organization-validated and extended-validation certificates.\r\n"},{"title":"What is an URL record?","slug":"url-record","category":"DNS","content":"The **URL** record is a [special DNSimple record](/articles/supported-dns-records). The URL records can be used to [redirect an hostname to another URL](/articles/redirect).\r\n\r\n## Create an URL record\r\n\r\nGo to the [advanced editor](/articles/advanced-editor) for your domain and select a URL record from the *Add Record* dropdown.\r\n\r\nEnter the hostname you would like to redirect from, and the URL to redirect to.\r\n\r\n- `hostname`: The hostname is the name part of the non-HTTPS fully-qualified domain name you want to handle. For example, if you want to redirect `example.com` leave it blank. To redirect a subdomain such as `www.example.com`, enter only `www`.\r\n\r\n- `URL`: The HTTP or HTTPS URL to redirect to. It can be also be a subdirectory of a site or a single page.\r\n\r\n![Create URL record](http://f.cl.ly/items/0T2X0w3c3N2S2A1k3v2T/dnsimple-url-record-create.png)"},{"title":"DNSimple Name Servers","slug":"dnsimple-nameservers","category":"Name Servers","content":"In order for DNSimple to provide DNS for one of your domain names you must change the name servers for your domain at your domain registrar.\r\n\r\nThe DNSimple name servers are:\r\n\r\n- ns1.dnsimple.com\r\n- ns2.dnsimple.com\r\n- ns3.dnsimple.com\r\n- ns4.dnsimple.com\r\n\r\nIf you registered your domain with DNSimple then your name servers will already be set to the DNSimple name servers and there is nothing else you need to do.\r\n\r\nIf you transferred your domain into DNSimple from another registrar then you need to change your name severs to DNSimple once you are ready for us to provide your DNS. To change your name servers to DNSimple for a domain that you transferred just go to your domain page and follow the link that *Switch to DNSimple Name Servers*. We do not automatically change your name servers to ours during the transfer process.\r\n\r\nIf you need to provide the IP addresses to your current registrar you may use the following addresses:\r\n\r\n<table>\r\n<tr>\r\n<th>Name</th>\r\n<th>IPv4 Address</th>\r\n<th>IPv6 Address</th>\r\n</tr>\r\n<tr>\r\n<td>ns1.dnsimple.com</td>\r\n<td>198.241.10.53</td>\r\n<td>2620:111:8000::53</td>\r\n</tr>\r\n<tr>\r\n<td>ns2.dnsimple.com</td>\r\n<td>198.241.11.53</td>\r\n<td>2620:111:8001::53</td>\r\n</tr>\r\n<tr>\r\n<td>ns3.dnsimple.com</td>\r\n<td>50.31.242.53</td>\r\n<td>2620:111:8002::53</td>\r\n</tr>\r\n<tr>\r\n<td>ns4.dnsimple.com</td>\r\n<td>50.31.243.53</td>\r\n<td>2620:111:8003::53</td>\r\n</tr>\r\n</table>"},{"title":"Do you support Reverse DNS (i.e. PTR records)?","slug":"reverse-dns","category":"Advanced DNS","content":"DNSimple does support reverse DNS entries however we do not enable this feature by default on customer accounts. We'll be happy to enable it for you, however first please ensure that you will actually be able to delegate the portion of the subnet that you would like us to respond for reverse DNS queries.\r\n\r\nIn many cases you may not have control over your subnet, depending on your hosting company for that service. In this case you should ask your hosting company to set up the reverse DNS entries you require."},{"title":"Expiring Product Email Notifications","slug":"expiring-product-email-notifications","category":"DNSimple","content":"DNSimple monitors the expiration date of your products and sends you an email notification when they are at risk of expiring.\r\n\r\nThe following products are currently monitored:\r\n\r\n- Purchased domains\r\n- Purchased certificates\r\n- Purchased whois privacies\r\n\r\nAs soon as one of these products enters in the 60-day expiration period, we start delivering you an email notification.\r\n\r\nThere are two types of expiring domain notifications:\r\n\r\n- [Product Expiration](/articles/product-expiration-notification) - A digest email containing the list of products expiring within 2 months. Delivered every week, if you have expiring products.\r\n- [Product Expiring Tomorrow](/articles/product-expiring-tomorrow-notification) - A final reminder containing the list of products expiring in less than 24 hours. Delivered once, the day before the expiration date.\r\n\r\nThe notifications are delivered to the email address associated to your account."},{"title":"Where are your servers located?","slug":"where-are-your-servers-located","category":"DNSimple","content":"Our 4 Unicast name servers are on 4 different networks throughout the US. The network providers are:\r\n\r\n* RackSpace\r\n* Linode\r\n* Amazon AWS\r\n* ServerCentral\r\n\r\nOur Anycast network consists of 5 points-of-presence around the world:\r\n\r\n* San Jose, CA, US\r\n* Chicago, IL, US\r\n* Washington DC, US\r\n* Amsterdam, Netherlands\r\n* Tokyo, Japan"},{"title":".IT domain requirements","slug":"it-domain-requirements","category":"Domains","content":"To register an .IT (Italy) domain you must meet one of the following criteria:\r\n\r\n1. In possession of the citizenship or resident in a country belonging to the European Union (in the case of registration for natural persons)\r\n1. Established in a country belonging to the European Union (in the case of registration for other organizations)\r\n\r\nPlease make sure the Registrant contact you associate to the domain during the registration meets this requirement, otherwise the registration will be rejected by the registry.\r\n"},{"title":"What is Domain Auto-renewal?","slug":"domain-auto-renewal","category":"Domains","content":"Enabling auto-renewal on a domain will cause that domain to be automatically renewed prior to the domain's expiration.\r\n\r\nAuto-renewal usually occurs within the last 30 days prior to the domain expiration date, and may vary from domain to domain.\r\n\r\nYou may enable auto-renewal when you first register a domain, or any time after the domain has been registered and before the last 30 days before the domain expires."},{"title":"Can a URL record redirect requests over SSL?","slug":"url-redirect-ssl","category":"Advanced DNS","content":"No, our [redirect service](/articles/redirect) can only redirect non-SSL requests.\r\n\r\nThis means, for example, you cannot use the [URL record](/articles/url-record) to redirect the not-www to the www version of your domain with HTTPS.\r\n\r\n## Applicable redirects\r\n\r\nThe following redirects can be configured.\r\n\r\n```text\r\nhttp://example.com => http://www.example.com\r\nhttp://example.com => https://www.example.com\r\n```\r\n\r\n## Not applicable redirects\r\n\r\nThe following redirect cannot be configure and will result in a timeout.\r\n\r\n```text\r\nhttps://example.com => https://www.example.com\r\n```\r\n\r\n## Technical explanation\r\n\r\nURL forwarding is not really a DNS record type, rather it is produces an A record which points to an HTTP server. The HTTP server is then responsible for issuing the 301 redirect when it receives HTTP requests.\r\n\r\nIn order for an HTTP server to respond to SSL requests you would need to have your SSL certificate and private key on the server since it is the HTTP server that negotiates the SSL connection. It is impractical to have a shared URL forwarding server that would allow you to upload your SSL certificate and private key.\r\n\r\n## Alternatives\r\n\r\nInstead of using URL forwarding you can use an ALIAS or A record pointing to your host and then handle a redirect in your HTTP server or inside your application.\r\n"},{"title":"Moving domains between DNSimple accounts","slug":"moving-domain","category":"Domains","content":"DNSimple allows a domain to be used only once system-wide.\r\n\r\nTo move a domain to another DNSimple account use the *push* feature.\r\n\r\n![](http://f.cl.ly/items/1F2P3T2F432a3I1j212f/Move_Domain_within_DNSimple-4.png)\r\n\r\nOn DNSimple \"Manage\" your domain and click \"Move Within DNSimple\" under the \"Tasks\" section. Enter a destination email address of another DNSimple account. Please be certain that the email address you enter matches the correct account. Once the domain is moved you will no longer be able to control this domain under your current account.\r\n\r\nThe domain will be moved along with all of its records and SSL certificates."},{"title":"Advanced Record Editor","slug":"advanced-editor","category":"DNS","content":"The **Advanced Editor** is the DNSimple DNS editor. The editor gives you the ability to view, create and manage the DNS records for a domain.\r\n\r\nAny [supported DNS record type](/articles/supported-dns-records) can be managed from the advanced editor, except system records.\r\n\r\n## Access the advanced editor\r\n\r\nTo access the advanced editor from the main domain list page, click on the grey gear icon at the end of the domain row.\r\n\r\n![Advanced Editor from the domain list](http://f.cl.ly/items/2D1k2P1V0H3L0c1x3j1e/dnsimple-editor-from-list.png)\r\n\r\nFrom the domain page, click on the *Advanced Editor* button at the top of the page.\r\n\r\n![Advanced Editor from the domain page](http://f.cl.ly/items/0H423p0w2S340P0K3D1H/dnsimple-editor-from-show.png)\r\n\r\n## System records\r\n\r\nSystem Records are special DNS records created by DNSimple when you add a domain to your account. They are necessary to resolve your domain and cannot be edited from the advanced editor because they are managed by the DNSimple system.\r\n\r\nSystem Records are displayed in light grey in the advanced editor.\r\n\r\n![System Records](http://f.cl.ly/items/0F3x1q181e0g1U1e1a0y/dnsimple-system-records.png)\r\n\r\nThe system records include a [SOA record](/articles/soa-record) and the [four name servers](/articles/ns-record), as long as the domain is resolving with DNSimple name servers.\r\n\r\n## Create a record\r\n\r\nFrom the *Add a Record* menu select a DNS record type and click on the type to enter the new record page. DNSimple supports [several different DNS record types](/articles/supported-dns-records).\r\n\r\n![Select Record Type](http://f.cl.ly/items/0K1b3C0s0R072x2W0p3u/dnsimple-record-select.png)\r\n\r\nThe creation page varies depending on the record type you selected. In most cases, you will be asked to provide a **Name**, a content and a **TTL**.\r\n\r\n![New Record Page](http://f.cl.ly/items/1c2l2a2N0u0s1E1V1Q3Y/dnsimple-record-new.png)\r\n\r\n- `Name`: This is the record hostname. Leave it blank to configure a record for the root domain. Otherwise, just enter the subdomain part for a different hostname. You can also enter an `*` for a wildcard record.\r\n\r\n- `Content`: The content value and format changes depending on the selected record type. For instance, if you are creating an A record you will need to enter the IP address. For an ALIAS or CNAME record, the content will be the target fully-qualified domain name.\r\n\r\n- `TTL`: TTL standard for Time-to-Live. It determines how long a DNS lookup for that record can be cached. The default value is 1 hour (3600 seconds), but you can adjust it selecting as different value from the select field.\r\n\r\nEnter the required infomation and press *Add Record* to create the record.\r\n\r\n![Create Record](http://f.cl.ly/items/1g3w130v0q0k0Z1Y0N1a/dnsimple-record-create.png)\r\n\r\n## Edit a record\r\n\r\nTo modify a record, click on the edit icon at the end of the record row.\r\n\r\n![Update Record](http://f.cl.ly/items/1z1P0W2W0X0f2c1f3W2Y/dnsimple-record-update.png)\r\n\r\n## Delete a record\r\n\r\nTo delete a record, click on the red cross icon at the end of the record row.\r\n\r\n**WARNING:** Please note that there is no confirmation and no undo, currently the only way to restore a deleted record is to create it again.\r\n\r\n![Delete Record](http://f.cl.ly/items/0D2R2a0l0b3Y1H3U3c0Y/dnsimple-record-delete.png)\r\n"},{"title":"Resolution Status","slug":"resolution-status","category":"DNS","content":"The resolution status component in the domain page shows if the domain is currently resolving with [DNSimple name servers](http://support.dnsimple.com/articles/dnsimple-nameservers).\r\n\r\nThe indicator is based on the [Is It DNSimple?](http://isitdnsimple.com/) service and displays real-time results. When you load the page, the indicator fetches the current name servers for the domains and compares them with DNSimple name servers.\r\n\r\nYou can click on the refresh button to refresh the indicator without reloading the page.\r\n\r\n## Domain is Resolving\r\n\r\n![Domain is resolving](http://f.cl.ly/items/2Z0u0N131k3q0c1C1i06/resolution-status-resolving.png)\r\n\r\nWell done! The domain is resolving with our name servers. You can manage the domain records from the DNSimple advanced editor.\r\n\r\n## Domain is not Resolving\r\n\r\nIf the domain is not resolving correctly, the indicator will tell you how to point the domain to DNSimple.\r\n\r\nDon't forget to read the [domain resolution issues](/articles/domain-resolution-issues) article, it contains some common causes that prevent the domain to resolve correctly.\r\n\r\n### Domain registered with DNSimple\r\n\r\n![](http://f.cl.ly/items/3V0V1H0x0C2M2K1J1612/resolution-status-notresolving-maintained.png)\r\n\r\nIf the domain is registered with DNSimple, the indicator will provide a link to [switch to DNSimple name servers](/articles/pointing-domain-to-dnsimple).\r\n\r\nIf you registered the domain with us, we will set the name servers automatically. If you transferred the domain to us, please note we don't automatically switch your name servers and you will need to follow the link to point the domain to DNSimple.\r\n\r\n### Domain registered with other registrar\r\n\r\n![](http://f.cl.ly/items/2z2c2g0a2T2D2S0e1s0v/resolution-status-notresolving-notmaintained.png)\r\n\r\nIf the domain is registered with another registrar, the indicator will provide a link to the support page that tells you [how to point the domain to DNSimple at your current registrar](http://support.dnsimple.com/articles/delegating-dnsimple-hosted).\r\n"},{"title":"Why Should I Host my DNS with DNSimple?","slug":"reasons-hosting-dns","category":"DNSimple","content":"DNSimple is focused on one thing: making domain and DNS management simple and painless. \r\n\r\nWe provide a clean and easy-to-use web interface for domain registration and management as well as an iPhone application and an API.\r\n\r\nOur focus on DNS and domains allows us to continue to make improvements that are immediately useful to you, from improvements in our API to allow domain registration and transfers through automated means, to our web interface, which we continue to work on to make it easier and better for you.\r\n\r\nWe believe that our small size is actually a powerful reason for using DNSimple. When you email support@dnsimple you know you're getting support from someone who cares about you and your DNS. We will bend over backwards to resolve any DNS issues and will always be honest and forthcoming about what our service can and cannot do.\r\n\r\nIn short, you should host with DNSimple if you like simple and hassle-free DNS management and support from people who care.\r\n"},{"title":"Configuring a Redirect","slug":"redirect","category":"Domains","content":"DNSimple provides a special [URL record](/articles/url-record) you can use to redirect an hostname to another URL.\r\n\r\nThis feature can be used, for example, to redirect the www version of a domain the non-www hostname. Another use case is to redirect a secondary domain you purchased to the main domain, without pointing it to any web hosting service.\r\n\r\n## Configure a redirect\r\n\r\nGo to the [advanced editor](/articles/advanced-editor) for your domain and select a `URL` record.\r\n\r\n## Redirect status code\r\n\r\nThe redirect sets a 301 status code. The code is not configurable and it's currently not possible to return a 302 temporary redirect using the URL record.\r\n\r\n## Caveats\r\n\r\n[HTTP redirects will only work with non-SSL connections](/articles/url-redirect-ssl), you cannot redirect an HTTPs request to another URL.\r\n\r\nIf you need to use SSL then you should point your domain to the server where the SSL certificate is installed and handle redirection internally in your application code.\r\n"},{"title":"Transferring a Domain to DNSimple","slug":"transferring-domain","category":"Domain Transfers","content":"If you simply want to use DNSimple to host your DNS for a domain, then follow our instructions for switching to our name servers.\r\n\r\nIf you want DNSimple to act as your domain registrar then the basic process is as follows:\r\n\r\n- First make sure that you unlock your domain at its current registrar and get your domain authorization code. This code is often sent by your current registrar via email.\r\n- Log into DNSimple and click on \"Add a Domain\"\r\n- Check the box that says \"Register or transfer this domain\"\r\n- You may also enable \"Whois Privacy Protection\" so that it is enabled immediately upon completion of the transfer by checking the \"Enable WHOIS Privacy Protection\" check box.\r\n- Press \"Add Domain\"\r\n- Select a registrant and fill in any extended attributes that are required.\r\n- Press \"Transfer Domain\"\r\n\r\nYour domain transfer request will now be issued if there are no missing fields. You will receive an email requesting approval of the transfer. Follow the instructions in the email. Within 7 days your domain transfer request should complete.\r\n\r\nThe authorization email comes from info@transfer-approval.com and will be sent to the administrative contact in your current public whois details. In order to receive the email you may have to turn off whois privacy at your current registrar. Many registrars will not properly deliver transfer authorization emails when whois privacy is enabled. \r\n\r\nWe will only charge your credit card for the transfer once it has completed.\r\n\r\nYou can go to your domain list at any time to check on the status of pending transfers. Click on \"transfer in process\" to view detailed information about the transfer requests.\r\n"},{"title":"DNSimple Services","slug":"dnsimple-services","category":"DNSimple","content":"DNSimple provides several services that every system connected to the Internet needs: domain registration, hosted DNS and SSL certificates.\r\n\r\n## DNS Hosting\r\n\r\nDNSimple DNS hosting is billed as a monthly service. We currently offer three pricing tiers:\r\n\r\n- **Bronze** $3/month for up to 2 managed domains \r\n- **Silver** $8/month for up to 10 managed domains\r\n- **Gold**: $18/month for up to 50 managed domains\r\n- **Platinum**: $50/month for up to 500 managed domains\r\n\r\n## Domain Registration\r\n\r\nDNSimple domain registrations and transfers are billed on a yearly basis. Pricing varies depending on the domain name. For more information view the [domain pricing list](https://dnsimple.com/tld-pricing).\r\n\r\nAs a DNSimple customer you do not need to use our domain registration services in order to take advantage of our hosted DNS. If you want to use another registrar you may do so and just change your name servers to our name servers for domains that you want us to provide hosted DNS for.\r\n\r\n## SSL Certificates\r\n\r\nSSL certificates are available in two flavors:\r\n\r\n- Standard single host SSL certificates from RapidSSL ($20 per year)\r\n- Wildcard certificates from Comodo ($100 per year)\r\n\r\nLearn more about [DNSimple certificates](/articles/ssl-certificates)."},{"title":"Troubleshooting SSL error for *.heroku.com or *. herokuapp.com","slug":"ssl-certificate-herokuapp-error","category":"Heroku and DNSimple","content":"You pointed your domain to Heroku to use an SSL certificate and you are receiving an error message like this:\r\n\r\n> This is probably not the site you are looking for!\r\n>\r\n> You attempted to reach example.com, but instead you actually reached a server identifying itself as *.herokuapp.com. This may be caused by a misconfiguration on the server or by something more serious. An attacker on your network could be trying to get you to visit a fake (and potentially harmful) version of example.com.\r\n\r\n![Error](http://f.cl.ly/items/2Q1V0g1x3D0f2U2h282G/dnsimple-heroku-ssl-error.png)\r\n\r\nThis error occurs because you are pointing the DNS to the generic Heroku endpoint. Instead you need to **use the [custom SSL endpoint](https://devcenter.heroku.com/articles/ssl-endpoint) they provide to you**.\r\n\r\nDo not try to point to `proxy.herokuapp.com` as this will not work with a custom domain and SSL.\r\n\r\nFor more information visit this article about [using an SSL certificate with Heroku](http://support.dnsimple.biz/articles/ssl-certificate-with-heroku)."},{"title":"Price Change","slug":"price-change","category":"DNSimple","content":"Since the beginning of DNSimple we've stuck to our original price plans while working hard to bring you innovative DNS and domain services. After three years of business we have decided to raise our prices on our Silver plans to $8 per month and our Gold plans to $18 per month. Yearly pricing will also increase proportionately, however when you switch to yearly billing you will now get two months for free (twelve months for the price of ten). Thus Silver plan will be $80 when pre-paid for one year and the Gold plan will be $180 when pre-paid for one year. This new pricing will go into effect July 1st, 2013.\r\n\r\n## I've been a customer for a long time, will my prices go up?\r\n\r\nIf you already have a DNSimple account your prices will not be changed unless you change plans. If you switch to another plan or change to yearly billing then your account will be changed to the new pricing plan.\r\n\r\n## Are domain registration or certificate prices changing?\r\n\r\nCurrently only DNS hosting prices are changing - we are not changing the prices for domain registrations, transfers and renewals nor are we changing certificate prices.\r\n\r\n## Why are you raising your prices?\r\n\r\nWe have always worked hard to provide the best services and customer support for you, and raising our prices will help us to continue to improve across the board and bring you better, more solid DNS services going forward. We will eventually migrate all customers to our new Anycast network to bring higher performance and reliability to everyone.\r\n\r\n## This is totally unfair, who can I talk to?\r\n\r\nYou may <a href=\"mailto:support@dnsimple.com\">email support</a> if you'd like to discuss this pricing change with us."},{"title":"Vanity Name Servers","slug":"vanity-nameservers","category":"Advanced DNS","content":"If you would like to use our name servers but have them appear as though they were your name servers you may use the vanity name server functionality to accomplish this.\r\n\r\nTo request access to vanity name servers, please contact support@dnsimple.com.\r\n\r\nPlease see our documentation about changing to [DNSimple name servers](/articles/dnsimple-nameservers) for the IPv4 and IPv6 addresses required for your vanity name servers.\r\n\r\nIf you use name servers that are within your domain then activating vanity name servers through DNSimple will automatically add glue records for each of the name servers listed above. If you are using name servers under a different domain then you will need to set up the correct A record for each of the name servers."},{"title":"Troubleshooting Record Resolution Issues","slug":"record-resolution-issues","category":"DNS","content":"Here's a checklist of common issues to help you in case a record is not resolving correctly.\r\n\r\n\r\n## Check domain resolution status\r\n\r\nIn order to use our DNS services the domain should resolve with DNSimple. Check [this list of common domain resolution errors](/articles/domain-resolution-issues) to determine whether the domain is resolving with DNSimple.\r\n\r\n\r\n## Check you are using a fresh DNS cache\r\n\r\nBy default every DNS record lookup is cached up to the value specified in the time-to-live (TTL) setting of the record itself.\r\n\r\nWhenever you change a record, the old record value may live in your cache until the expiration giving you the impression the update was not performed.\r\n\r\nThis is the result from a fresh `dig` query for the record `www.dnsimple.com`. Notice the `ANSWER` section.\r\n\r\n```\r\n$ dig www.dnsimple.com\r\n\r\n; <<>> DiG 9.8.3-P1 <<>> www.dnsimple.com\r\n;; global options: +cmd\r\n;; Got answer:\r\n;; ->>HEADER<<- opcode: QUERY, status: NOERROR, id: 63190\r\n;; flags: qr rd ra; QUERY: 1, ANSWER: 2, AUTHORITY: 0, ADDITIONAL: 0\r\n\r\n;; QUESTION SECTION:\r\n;www.dnsimple.com.      IN  A\r\n\r\n;; ANSWER SECTION:\r\nwww.dnsimple.com.   3600    IN  CNAME   dnsimple.com.\r\ndnsimple.com.       600 IN  A   50.31.209.238\r\n\r\n;; Query time: 605 msec\r\n;; SERVER: 8.8.8.8#53(8.8.8.8)\r\n;; WHEN: Fri Jul 19 15:15:39 2013\r\n;; MSG SIZE  rcvd: 64\r\n```\r\n\r\nThis is the same query performed a few seconds later. Notice again the `ANSWER` section.\r\n\r\n```\r\n;; ANSWER SECTION:\r\nwww.dnsimple.com.   3543    IN  CNAME   dnsimple.com.\r\ndnsimple.com.       543 IN  A   50.31.209.238\r\n```\r\n\r\nIn this case, `dig` is telling me I have to wait 3534 seconds (about an hour) before the cache for the record is expired. If I make a change now, it may not be visible from my local machine for an hour.\r\n\r\nFor this reason, make sure to clear the DNS cache before checking a record update. This may involve:\r\n\r\n1. Clearing system level DNS cache\r\n1. Restart browser sessions\r\n\r\nAnother alternative is to check the changes with a mobile device or another computer outside of your local home or office network.\r\n\r\n\r\n## Check record propagation delay\r\n\r\nIf you recently changed a record it may take awhile for the change to propagate. This is especially true if the record has been cached by your local ISP.\r\n\r\nIn most cases, you can bypass a propagation delay by passing a custom name server in the `dig` call.\r\n\r\nThe following command checks the DNS record against the `ns1.dnsimple.com` name server.\r\n\r\n```\r\n$ dig www.dnsimple.com @ns1.dnsimple.com\r\n```\r\n\r\nIf the response is the one you expect, it means the record has been updated in our system but the changes still need propagate. In all likelihood, they will be visible after the TTL period.\r\n\r\nYou can check against any of [DNSimple's name servers](/articles/dnsimple-nameservers).\r\n\r\nIf the query is not returning the correct value make sure there isn't a delay in the record update. See the section *Check record update delay*.\r\n\r\n\r\n## Check record update delay\r\n\r\nWhenever you change a record in our system, the changes are published almost immediately.\r\n\r\nIn some cases, our update queue may take a little bit longer. Please wait a couple of minutes and check again.\r\n\r\nMake sure to follow our blog or Twitter account. We normally publish status updates in case of known issue with our update queue.\r\n"},{"title":"Changing an SSL Certificate Approver Email","slug":"changing-ssl-certificates-email","category":"SSL Certificates","content":"If you selected an invalid approver email, you can request the email to be changed.\r\n\r\nThe certificate must be in the submitted state.\r\n\r\nPlease note that [**it's not possible to change the approver email to an arbitrary email address**](/articles/ssl-certificates-email-approval). This is a requirement enforced by the certificate authority for the certificate domain validation.\r\n\r\n##### To change the approval email\r\n\r\n1. [Contact us](/contact) to change the approver email. Make sure you provide the fully-qualified certificate name (eg. `www.example.com`, `*.example.com`) and the new approver email.\r\n"},{"title":"SSL Certificate Email Approval","slug":"ssl-certificates-email-approval","category":"SSL Certificates","content":"The email approval is the most common domain validation method for a certificate. It is required for domain-validated certificates.\r\n\r\nThis step validates the domain is registered and someone with admin rights on the domain is aware of and approves the certificate request.\r\n\r\nThe domain approval consists in three steps:\r\n\r\n1. When you purchase a certificate, you select an email recipient called approver email.\r\n1. The [Certificate Authority](/articles/what-is-a-certificate-authority) sends an approval email (also called DCV email) to the approver email with an unique link to approve the certificate and validate your domain ownership.\r\n1. You click on the link. At this point, the certificate is validated and the authority will generate it.\r\n\r\n## Choosing the approval email\r\n\r\nThe approval email typically can be sent to the following addresses:\r\n\r\n- admin@example.com\r\n- administrator@example.com\r\n- hostmaster@example.com\r\n- postmaster@example.com\r\n- webmaster@example.com\r\n\r\nwhere `example.com` is the domain you are purchasing a certificate for. \r\n\r\nIn certain cases, the approval email can be sent to a contact email address listed for the domain name in Whois. In this case, you may need to disable the Whois Privacy feature or any another privacy protection service until the order is approved.\r\n\r\nThe approval email *cannot be an arbitrary email* or any other email.\r\n\r\n## Selecting an SSL Certificate Approver Email\r\n\r\nYou [select the approver email](#) when you purchase the certificate. You can also [change the recipient](/articles/changing-ssl-certificates-email) or [resend the approval email](/articles/resending-ssl-certificates-email).\r\n"},{"title":"How long does it take for a new record to resolve for my domain?","slug":"how-long-does-it-take-for-a-new-record-to-resolve-for-my-domain","category":"DNS","content":"If your account is active then records that you add to a domain will be available within seconds from any of our name servers.\r\n\r\nIf your account is not yet active then records for your domains will be available once you activate your account.\r\n\r\nIf you query a name that is not yet in the system then some name servers may cache the negative response. In this case it may take up to an hour for the negative result to be cleared from the name server cache and for the correct response to appear."},{"title":".IO Renewals","slug":"io-renewals","category":"Domains","content":"IO domains do not follow the same renewal procedures as normal TLDs like com, net and org. IO domains must have auto-renewal enabled to be renewed. IO domains may not be renewed manually at this time.\r\n\r\nThe auto-renewal must be set 1 month before the domain will expire. **The best solution is to always have auto-renewal enabled**. When new .io domains are registered with DNSimple we default to auto-renewing the domain in order to avoid issues. **Please do not disable auto-renewal on IO domains unless you are absolutely sure you do not want the domain renewed**.\r\n\r\nYou may always check if a domain is set up to auto-renew and turn auto-renewal on from your domain list. If auto-renewal is enabled you will see an icon like this next to the domain: \r\n\r\n![](http://f.cl.ly/items/2B0R1q1f3k3O3M2G163w/Domains_-_DNSimple.png)\r\n\r\nIf auto-renewal is not enabled, the icon will look like this:\r\n\r\n![](http://f.cl.ly/items/1h2J0U322V0M0k1m2J2x/Domains_-_DNSimple-2.png)\r\n\r\nNote: you may receive one or more emails from the .io registry *after* your .io domain has been submitted for auto-renewal but before the domain is renewed by the .io registry. As long as you have received notification from us indicating your domain has been renewed, you do not need to worry about this email."},{"title":".ES domain requirements","slug":"es-domain-requirements","category":"Domains","content":"Anyone may register a .ES domain, however you will need to provide additional information:\r\n\r\n1. Registrant ID Type: You may choose to provide us any of the following identification details: \r\n  - VAT ID (DNI or NIF): Select this option if you can provide us either your Spanish National Personal ID or your company VAT ID number;\r\n  - Resident alien ID (NIE): Select this option if you can provide us your Spanish resident alien ID number;\r\n  - Generic ID: Select this option if you do not have any of the above mentioned IDs, but can provide either your Passport number, any Foreign ID document number, Company Registration number, Drivers License number, etc.\r\n1. Registrant ID Number: Depending upon the option you selected above, you need to provide that ID's number here."},{"title":"SSL Certificates Current Best Practices","slug":"ssl-certificates-current-best-practices","category":"SSL Certificates","content":"DNSimple offers SSL certificates from two different [certificate authorities (CAs)](/articles/what-is-a-certificate-authority). RapidSSL for normal, single name certificates and Comodo for wildcard certificates.\r\n\r\nThere are three broad steps to installing a certificate.\r\n\r\n- Generating a private key and a certificate signing request (CSR). \r\n- Requesting a CA validate your identity and sign the certificate. \r\n- Installing your private key and the certificate on your server.\r\n\r\n## Private key and certificate signing request\r\n\r\nDNSimple will automatically generate these if you like. They will be available to download once generated. You may choose to permanently delete the private key stored at DNSimple to increase your security. Be sure you have stored the private key safely as it is the only way to use your SSL certificate.\r\n\r\nAlternatively, you may generate your private key and CSR using publicly available tools that are beyond the scope of this article.\r\n\r\nThe certificate is uniquely associated to a single name or a wildcard name. You need to [select the hostname](/articles/ssl-certificate-hostname) during the purchase.\r\n\r\n## Certificate authority validation and signing\r\n\r\nThese types of certificates are verified via email only.\r\n\r\nA CA will present several common email addresses for your domain to choose from (i.e. admin@example.com, webmaster@example.com, etc). In addition to these the CA will present the email address listed as your administrative contact for your domain. \r\n\r\nIf you don't have (and don't want to configure) any of these common email addresses your domain administrator email address is easiest to change. To change it follow \"Contacts\" at the top of the page on DNSimple, then \"Manage\" your domain, and follow \"Change Contacts\".\r\n\r\nIf domain privacy is enabled you may wish to disable it long enough for the CA to retrieve your real admin email address.\r\n\r\nAfter submitting your request you will receive a message containing a link to validate your identity at the email address you selected. Be sure to check your junk folder in case it was inadvertently routed there.\r\n\r\nIt may take up to four days to receive your validation email and, once validated, signed by the CA. In general we see certificates being signed the same day.\r\n\r\nEvery so often we see a certificate held up by the CA for other reasons. If you feel its taking longer than expected please contact DNSimple support and we will investigate.\r\n\r\n## Installing your private key and certificate\r\n\r\nEach software package (web, email server, etc.) may have a unique method to install private keys and certificates.\r\n\r\nPlease see these certificate authority installation instructions for various packages:\r\n\r\n- [RapidSSL](https://knowledge.rapidssl.com/support/ssl-certificate-support/index?page=content&id=SO16226&actp=LIST&viewlocale=en_US)\r\n- [Comodo](https://support.comodo.com/index.php?_m=knowledgebase&_a=view&parentcategoryid=95&pcid=1&nav=0,96,1)\r\n\r\nYou may also find the following guides useful:\r\n\r\n- [Heroku Guide for DNSimple Certificates](https://devcenter.heroku.com/articles/ssl-certificate-dnsimple)\r\n- [Ryan McGeary's Guide](http://ryan.mcgeary.org/2011/09/16/how-to-add-a-dnsimple-ssl-certificate-to-heroku/)"},{"title":"Troubleshooting Domain Resolution Issues","slug":"domain-resolution-issues","category":"DNS","content":"In order to use DNSimple's managed DNS service your domain should resolve with DNSimple.\r\n\r\nYou can check domain resolution status using [Is It DNSimple?](http://isitdnsimple.com/). Resolution status is also displayed on the domain page in your DNSimple account.\r\n\r\nHere's a checklist of common issues to help you in case a domain is not resolving correctly.\r\n\r\n\r\n## Name server propagation delay\r\n\r\nIf you recently pointed the domain to DNSimple and the domain is still not resolving, please note that it may take up to 24 hours for a name server change to propagate.\r\n\r\nYou can check whether the update was successful by inspecting the WHOIS response for the domain as described in the section *Check name server list in the WHOIS response*.\r\n\r\nThe WHOIS response is normally updated in a few minutes.\r\n\r\nIf after 24 hours the domain is still not resolving, make sure the update was successfully confirmed by your current domain registrar and see the other sections in this page.\r\n\r\n\r\n## Check the domain is using the DNSimple name servers\r\n\r\nEnsure the domain is using [DNSimple name servers](/articles/dnsimple-nameservers).\r\n\r\nIf not, update the name server to [point to DNSimple](/articles/pointing-domain-to-dnsimple).\r\n\r\nYou can use `dig` or any other DNS tool to get the name servers for the domain.\r\n\r\n```\r\n$ dig NS example.com +short\r\nns1.dnsimple.com.\r\nns2.dnsimple.com.\r\nns3.dnsimple.com.\r\nns4.dnsimple.com.\r\n```\r\n\r\nThe order of the name servers is irrelevant.\r\n\r\n\r\n## Check the domain with +trace\r\n\r\nThe `+trace` option from `dig` shows exactly how the name is delegated.\r\n\r\nIt executes a recursive query against each of the name servers in the chain, starting from the root name servers. It's useful to debug delegation issues.\r\n\r\n```\r\n$ dig NS example.com +trace\r\n```\r\n\r\nThe delegated name servers should match [DNSimple name servers](/articles/dnsimple-nameservers).\r\n\r\nIf not, update name servers to [point to DNSimple](/articles/pointing-domain-to-dnsimple). If you recently switched the update may be in progress. See the sections *Check name server list in the WHOIS response* and *Check name server propagation delay*.\r\n\r\n\r\n## Check the domain is using *all* DNSimple name servers\r\n\r\nDNSimple provides four name servers. You should include all the name servers to make sure DNS will resolve in case one name server temporarily unavailable for maintenance, etc.\r\n\r\n\r\n## Check the domain is using *only* DNSimple name servers\r\n\r\nIn some cases a misconfiguration may result in DNSimple name servers listed along with third party name servers.\r\n\r\n```\r\n$ dig NS example.com +short\r\nns1.dnsimple.com.\r\nns2.dnsimple.com.\r\nns3.dnsimple.com.\r\nns4.dnsimple.com.\r\nns1.thirdparty.com.\r\nns2.thirdparty.com.\r\n```\r\n\r\nThis configuration may lead to random DNS resolution issue, especially if you are using DNS custom features such as ALIAS or URL records and/or the two DNS services are not in sync. \r\n\r\n\r\n## Check name server list in the WHOIS response\r\n\r\nUse a WHOIS service to run a whois query for the domain. The majority of domain registries include the name server list in the WHOIS response.\r\n\r\n```\r\n$ whois dnsimple.com\r\n\r\nDomain Name: DNSIMPLE.COM\r\nRegistrar: ENOM, INC.\r\nWhois Server: whois.enom.com\r\nReferral URL: http://www.enom.com\r\nName Server: NS1.DNSIMPLE.COM\r\nName Server: NS2.DNSIMPLE.COM\r\nName Server: NS3.DNSIMPLE.COM\r\nName Server: NS4.DNSIMPLE.COM\r\nStatus: clientTransferProhibited\r\nUpdated Date: 13-jun-2013\r\nCreation Date: 07-apr-2010\r\nExpiration Date: 07-apr-2018\r\n```\r\n\r\nThe name server should match DNSimple name servers and the response returned from `dig`. If not, make sure to [point the domain to DNSimple](/articles/pointing-domain-to-dnsimple).\r\n\r\nIf you recently updated the domain, see the section *Name server change propagation*.\r\n\r\n\r\n## Contact us\r\n\r\nPlease be sure to check the common issues in this checklist to narrow down the problem.\r\n\r\nIf the problem is not in this list or you have any other questions, please [contact us](/contact).\r\n"},{"title":"What is a NS Record?","slug":"ns-record","category":"DNS","content":"An NS record is used to delegate a subdomain to a set of name servers. Whenever you delegate a domain to DNSimple the TLD authorities place NS records for your domain in the TLD name servers pointing to us. For example, in the com name servers there are the following entries delegating dnsimple.com to our name servers:\r\n\r\n```\r\ndnsimple.com. 172800 IN NS ns1.dnsimple.com.\r\ndnsimple.com. 172800 IN NS ns2.dnsimple.com.\r\ndnsimple.com. 172800 IN NS ns3.dnsimple.com.\r\ndnsimple.com. 172800 IN NS ns4.dnsimple.com.\r\n```\r\n\r\nWe also automatically publish NS records in our authoritative name servers for each domain we are authoritative for. These NS records will appear in the System Records section of each domain's Manage page, and will either be our default name servers (ns1.dnsimple.com through ns4.dnsimple.com) or your vanity name servers if you have vanity name servers.\r\n\r\nIf you would like to delegate a registered domain name to a different DNS provider, then you can do that through the domain's Manage page. You cannot remove or change the NS records for your domain in the Advanced Editor page."},{"title":"Choosing the SSL Certificate Hostname","slug":"ssl-certificate-hostname","category":"SSL Certificates","content":"DNSimple provides both [single name and wildcard certificates](/articles/ssl-certificates).\r\n\r\n## Single name certificate\r\n\r\nThe single name certificate is valid only for the hostname specified with the certificate.\r\n\r\nFor example, if you purchase a certificate for the hostname `secure.example.com`, you can't use it for `www.example.com` or `example.com`. Any attempt to serve these hostnames with the certificate will result in a security warning in most browsers.\r\n\r\nThe only exception is the root domain, in case you purchase a certificate for the www-hostname, as described below.\r\n\r\n## Wildcard certificate\r\n\r\nThe wildcard certificate is valid only at a single level sub-domain. You use the wildcard \"`*`\" symbol to indicate the sub-domain.\r\n\r\nFor example, if you purchase a wildcard certificate for `*.example.com`, you can use it in any `example.com` first-level subdomain such as `www.example.com`, `secure.example.com` or `private.example.com`. However, you can't use it for `www.secure.example.com` or `super.secure.example.com`.\r\n\r\n## Root domain\r\n\r\nBoth single name and wildcard certificates can be used on the root domain (e.g. `example.com`) at the following conditions:\r\n\r\n- For the single name certificate you must purchase a certificate for the www-hostname (e.g. `www.example.com`). If you purchase a certificate for the root domain you will not be able to use it for the www hostname.\r\n- For the wildcard certificate you must purchase a certificate for the third level domain pattern (e.g. `*.example.com`).\r\n"},{"title":"Supported DNS Record Types","slug":"supported-dns-records","category":"DNS","content":"We currently support the following standard record types:\r\n\r\n- [A](/articles/a-record)\r\n- [CNAME](/articles/cname-record)\r\n- [MX](/articles/mx-record) \r\n- [NS](/articles/ns-record)\r\n- TXT\r\n- SPF\r\n- SRV\r\n- NAPTR\r\n- AAAA\r\n- HINFO\r\n- SSHFP\r\n\r\nWe also support several special record types:\r\n\r\n- [ALIAS](/articles/alias-record)\r\n- [URL](/articles/url-record)\r\n- POOL\r\n\r\nFinally, we automatically add your [SOA](/articles/soa-record) record for you when you add a domain."},{"title":"What is a POOL record?","slug":"pool-record","category":"DNS","content":"A POOL record is a virtual record type that we created at DNSimple to provide a way to randomly select from multiple hosts when resolving a CNAME record. For example, imagine you would like the host name \"www.example.com\" to resolve to two different hosts, for example \"example.provider1.com\" and/or \"example.provider2.com\". The POOL record makes this possible by randomly returning one or the other as a CNAME record. This would allow you to randomly distribute requests to either provider. It would also allow you to remove specific providers from the pool of available providers at any point in time. Once a provider is removed and the record has cleared from resolver caches, no new requests will go to that provider."},{"title":"Selecting an SSL Certificate Approver Email","slug":"selecting-ssl-certificates-email","category":"SSL Certificates","content":"The [SSL certificate email approval](#) is required for domain-validated certificates.\r\n\r\nYou are asked to select an approver email immediately after you purchase a new certificate.\r\n\r\n# To select an approver email\r\n\r\n1.  Read the list of all available approver emails.\r\n    \r\n    ![](http://f.cl.ly/items/2y2G0T1S3B3U1I013A2c/dnsimple-ssl-selectapprover.png)\r\n\r\n1.  Choose the email address you want to use by clicking on it.\r\n1.  Click *Send Approver Email* to configure and submit the certificate for validation.\r\n\r\nIf the approver is not in this list or you need time to configure one of those emails, you can also close this page and come back later.\r\n\r\n# To select an approver email for a previously purchased certificate\r\n\r\n1.  Log into your DNSimple account.\r\n1.  Go to the *Domains* tab and select the relevant domain.\r\n1.  Scroll down to the *Active SSL Certificate* list and click on the certificate.\r\n    \r\n    ![](http://f.cl.ly/items/3C2J2Z2h1c1u1T2f2b2P/dnsimple-ssl-pagelink-purchased.png)\r\n\r\n1.  Click on *complete the setup process now*.\r\n\r\n    ![](http://f.cl.ly/items/3P3J1I2G0T2j283g0H2T/dnsimple-ssl-completesetup.png)\r\n\r\n1.  Read the list of all available approver emails.\r\n\r\n    ![](http://f.cl.ly/items/2y2G0T1S3B3U1I013A2c/dnsimple-ssl-selectapprover.png)\r\n    \r\n1.  Choose the email address you want to use by clicking on it.\r\n1.  Click *Send Approver Email* to configure and submit the certificate for validation.\r\n\r\nYou can also [change the recipient](/articles/changing-ssl-certificates-email) or [resend the approval email](/articles/resending-ssl-certificates-email).\r\n"},{"title":"SSL Certificate Types","slug":"ssl-certificates-types","category":"SSL Certificates","content":"There are several types of SSL Certificates. This article quickly explains the differences between the various types you may want to use to secure a website.\r\n\r\nYou can group SSL certificates by validation level or secured domains/hostnames.\r\n\r\n\r\n## SSL Certificates by Validation Level\r\n\r\nThe validation level determines the method adopted by the Certificate Authority to confirm the identity of the certificate applicant.\r\n\r\n### Domain Validated SSL Certificates\r\n\r\nThe Domain Validated SSL Certificate validates the domain is registered and someone with admin rights is aware of and approves the certificate request.\r\n\r\nThe validation process is normally performed [via email](/articles/ssl-certificates-email-approval) or DNS. The owner is requested to prove admin right by receiving and confirming an email sent to an administrative email for the domain, or by configuring some specific DNS records for the domain.\r\n\r\nThe order normally takes from a few minutes to a few hours.\r\n\r\nIf the certificate is valid and signed by a trusted authority, the browsers indicate a successfully secured HTTPS connection.\r\n\r\n![](http://f.cl.ly/items/0L1c3U0q450g2t1K3R18/dnsimple-ssltypes-https.png)\r\n\r\n**NOTE:** DNSimple currently provides both [single-name and wildcard](http://support.dnsimple.com/articles/ssl-certificates) domain-validated certificates.\r\n\r\n### Organization Validated SSL Certificates\r\n\r\nThe Organization Validated SSL Certificate (OV certificate) validates the domain ownership, plus organization information included in the certificate such as name, city, state and country.\r\n\r\nThe validation process is similar to the domain validated certificate, but it requires additional documentation to certify the company identity.\r\n\r\nThe order can take from a few hours to a few days, due to the company validation process.\r\n\r\nThe Organization Validated SSL Certificates display the company information in the certificate details.\r\n\r\n![](http://f.cl.ly/items/2v1L363P0Q0N3G3V0J15/dnsimple-ssltypes-company.png)\r\n\r\n**NOTE:** DNSimple currently doesn't provide organization-validated certificates.\r\n\r\n### Extended Validation SSL Certificates\r\n\r\nThe Extended Validation SSL Certificate (EV certificate) requires an extended validation of the business. It validates domain ownership and organization information, plus the legal existence of the organization. It also validates that the organization is aware of the SSL certificate request and approves it.\r\n\r\nThe validation requires documentation to certify the company identity plus a set of additional steps and checks.\r\n\r\nThe order can take from a few days to a few weeks, due to the extended validation process.\r\n\r\nThe Extended Validation SSL Certificates are generally identified with a green address bar in the browser containing the company name.\r\n\r\n![](http://f.cl.ly/items/3608163u2b2n2U1D3p3T/dnsimple-ssltypes-greenbar.png)\r\n\r\n**NOTE:** DNSimple currently doesn't provide extended validation certificates.\r\n\r\n\r\n## SSL Certificates by Secured Domains\r\n\r\nAn SSL certificate is associated to one or more secured host names that restrict the scope of a certificate.\r\n\r\n## Single-name SSL Certificates\r\n\r\nSingle-name SSL certificates protects a single subdomain (hostname).\r\n\r\nFor example, if you purchase a certificate for `www.example.com` it will not secure `mail.example.com`.\r\n\r\nOn sole discretion of the certificate authority, if you purchase a single-name certificate for the www hostname (www.example.com) the certificate may also include the root domain.\r\n\r\nDNSimple currently provides [single-name certificates](http://support.dnsimple.com/articles/ssl-certificates).\r\n\r\n## Wildcard SSL Certificates\r\n\r\nSingle-name SSL certificates protects an unlimited number of subdomains of a single domain.\r\n\r\nFor example, if you purchase a certificate for `*.example.com` if will secure `foo.example.com`, `bar.example.com`, etc. It will not secure `foo.else.example.com`.\r\n\r\n**NOTE:** DNSimple currently provides [wildcard certificates](http://support.dnsimple.com/articles/ssl-certificates).\r\n\r\n## Multi-Domain SSL Certificates\r\n\r\nMulti-domains SSL certificates protects different domains with a single certificate.\r\n\r\nYou can normally secure a combination of different subdomains from different domains.\r\n\r\n**NOTE:** DNSimple currently doesn't provide multi-domain certificates.\r\n\r\n\r\n## Security\r\n\r\nIt's important to remember that the validation level and the number of secured domains don't affect the security level offered by an SSL certificate.\r\n\r\nAll certificates work with the following encryption principle.\r\n"},{"title":"Renewing an SSL Certificate","slug":"renewing-ssl-certificates","category":"SSL Certificates","content":"An SSL certificate renewal is effectively a new SSL certificate purchase. The easiest thing to do is to have us automatically generate the CSR (and a new private key to go with it) and submit the order. Once the new certificate is generated you can go through the same process for installing the private key and certificate as you would with any new SSL purchase.\r\n\r\nAll DNSimple SSL certificates are valid for one year from their purchase date. Sixty days before the certificate expires you will begin receiving renewal notices.\r\n\r\nWhen you renew a certificate, you will need to go through the [certificate approval process](/articles/ssl-certificates-email-approval) again since a new certificate will be issued. **If you don't approve the certificate, the renewal is not completed**.\r\n\r\n**IMPORTANT:** A renewal will not extend your existing certificate expiration date, it will result in a brand new certificate that must be installed.\r\n\r\nYou may have more than 1 certificate for a host name at DNSimple at the same time, so renewing your certificate prior to the expiration date of your current certificate will not affect your operations. Note, however, that you will only be able to install 1 certificate on your server at a time.\r\n\r\n## RapidSSL\r\n\r\nFor single host SSL certificates issued by RapidSSL, if you renew prior to the current certificate's expiration date your new certificate expiration date will be extended as follows:\r\n\r\n* 46 - 90 days before expiration date, extend 3 months\r\n* 16 - 45 days before expiration date, extend 2 months\r\n* 15 days or less before expiration date, extend 1 month\r\n* Up to 15 days after expiration date, extend 1 month\r\n\r\nThis extension will be from the new certificate's purchase date.\r\n\r\n## Comodo\r\n\r\nWildcard certificate will not be extended so you should purchase your new wildcard certificate close to your old certificate's expiration date, but with enough time for the certificate to be issued. 1 week before expiration should be sufficient.\r\n\r\n## Heroku\r\n\r\nIf you are using your certificate on Heroku then you may find https://devcenter.heroku.com/articles/ssl-certificate-dnsimple helpful when preparing and deploying your newly issued certificate.\r\n"},{"title":"What is an A record?","slug":"a-record","category":"DNS","content":"The *A* in A record stands for *Address*. Simply put, an A record is used to find the address of a computer connected to the internet from a name. Whenever you visit a web site, send an email, connect to Twitter or Facebook or do almost anything on the Internet, the address you enter is a series of words connected with dots.\r\n\r\nFor example, to get to this blog you may have followed a link from another web site pointing to blog.dnsimple.com. In my DNSimple account is an A record that points blog.dnsimple.com to the IP address 72.32.231.8.\r\n\r\n![A Record](http://f.cl.ly/items/072v403p2I0T3e2a1B0F/dnsimple-record-a.jpg)\r\n\r\nWhen you clicked on this link your computer probably asked a nearby DNS server \"Is there an address record for blog.dnsimple.com?\". If the server can answer this question then it replied with: \"Yes, the address for blog.dnsimple.com is 72.32.231.8\". If it cannot answer the question directly then it probably went and asked another DNS server if they have the answer, and that server either answered or asked another server, and so on. This process is called \"resolving\" and is the way that all DNS requests are handled on the Internet. How it does it isn't important right now, what matters is that ultimately a DNS server answers with the correct answer and your web browser now knows that it should request the DNSimple blog's home page from 72.32.231.8.\r\n\r\nYou can actually do quite a bit more with A records, including using multiple A records for the same domain in order to provide redundancy. Additionally multiple names could point to the same address, in which case each would have it's own A record pointing to the same IP address.\r\n\r\nThe bottom line: A records are used to map a name to a computer's address on the Internet, and are one of the primary records used in DNS servers."},{"title":"Common DNS Records","slug":"common-dns-records","category":"DNS","content":"DNS is full of jargon - look, I can't even say the name without resorting to an acronym. The good news is that most domain names only need a few things to function correctly.\r\n\r\nFirst, if you are using any one of the services we support (like Google Apps, Heroku, Posterous, etc.) then you should just use our services feature to add the services you need to the domain. It's pretty simple: log in, go to the domain's manage page and click *Add Services to Domain*.\r\n\r\nIn addition most domains will likely want to lead visitors to a web site. Your hosting company will often provide you with 1 or more IP addresses for your web site. These will be something like `34.23.149.20`.\r\n\r\nTo point your domain to an IP address like this add an [A record](/articles/a-record). Leave the Name field blank and fill in the Address field with the address provided by your hosting company. If you host with someone like Heroku or Amazon AWS, where they provide you a hostname instead of an IP address, then you can use the [DNSimple ALIAS record](/articles/alias-record) to point `yourdomain.com` to the hostname.\r\n\r\nYou may also want to have `www.yourdomain.com` point to `yourdomain.com`. \r\n\r\n1. Create a [CNAME record](/articles/cname-record) with the name `www`\r\nand with value `yourdomain.com`.\r\n2. Create an URL forwarding record pointing the name `www` to `http://yourdomain.com` which will cause the URL visitors see to switch `www.yourdomain.com` to `yourdomain.com`.\r\n"},{"title":"Why anycast DNS?","slug":"why-anycast-dns","category":"DNS","content":"The DNS protocol most often uses UDP to ship packets around the internet. UDP being a stateless protocol enables an optimization based on anycast.\r\n\r\nMore often than not you want to talk to a specific computer on the internet. When a packet is sent to another computer on the internet the many routers in between make forwarding decisions according to their routing table. As your packet meanders through each router those tables get your packet closer to the one computer youre after. This is unicast.\r\n\r\nWhen your customer looks up an IP address for your app they query DNS. All of our name servers have identical answers so we dont care which one answers. With anycast we use internet routing capabilities to make it happen quicker.\r\n\r\nPacket latency is largely a function of geographic distance. With anycast we tell routers the same server is located at a bunch of different spots around the internet. Because internet routers are always optimizing routes they pick the one closest to your customer. Moving DNS servers closer mitigates this geographic latency component.\r\n\r\nWhile lower latency is the primary benefit we also gain resilience at the same time. Instead of four name servers we now have forty. If any of these forty go offline theyre removed from the routing table and others automatically pick up the slack.\r\n\r\nFinally, DNSimples ALIAS record type is a second-order DNS query. Since our anycast server is likely to be closer to the target geographic location an ALIAS record may resolve to a closer datacenter if your app is also geographically distributed.\r\n\r\nIf you're interested in trying our our Anycast network, sign into your DNSimple account and enable Anycast on each domain's Manage page. In the near future we will be moving all of our name servers to Anycast as well, so you'll no longer need to do anything special to take advantage of the benefits of Anycast."},{"title":"Differences Between A, CNAME, ALIAS and URL Records","slug":"differences-between-a-cname-alias-url","category":"DNS","content":"A records map a name to one or more IP addresses when the IP addresses are known and stable. CNAME records map a name to another name and are only used when there are no other records on that name.\r\n\r\nThe general rule is use an A record if you manage what IP addresses are assigned to a particular machine. If, on the other hand, the IP addresses can change and you don't control those changes then you might use a CNAME record, as long as that is the **only** record for that specific name. If you use a CNAME record for a name like www.example.com then you can't use other records like MX for that same name.\r\n\r\n**You should never use a CNAME record for your registered domain name (i.e. example.com).**\r\n\r\nIf you cannot use a CNAME record and you do not control the IP addresses, then you may use either an ALIAS record or a URL forwarding record. An ALIAS record will automatically resolve to the hostname's IP addresses. They have a short time-to-live and thus will reflect changes to the hostname's IP addresses quickly and may safely be used with other DNS records (like MX and NS records).\r\n\r\nURL forwarding records on the other hand are not really DNS records. A URL forwarding record indicates that our web server should perform a 301 HTTP redirect and thus it will return an A record pointing to our redirection server.\r\n\r\nNote that if you want to use SSL on a name you cannot use our redirection server."}]